# включить  " lz77-file.h "


// ------------------------------------------------ ---------
// пишет нули
аннулируются  Lz77File :: вровень ()
{
	для ( int i = 0 ; i < 7 ; i ++) putbit ( 0 );
}
// ------------------------------------------------ ---------
// режим чтения
аннулируются  Lz77File :: assign_write ( ИНТ ч)
{
	ручка = h;
	buff_char = 0 ;
	маска = 128 ;
}
// ------------------------------------------------ ---------
// режим записи
аннулируются  Lz77File :: assign_read ( ИНТ ч)
{
	ручка = h;
	buff_char = 0 ;
	маска = 0 ;
}
// ------------------------------------------------ ---------
// читать бит
bool  Lz77File :: getbit ()
{
	если ((маска >> = 1 ) == 0 )
	{
		_read (дескриптор, & buff_char, 1 );
		маска = 128 ; // двоичный 10000000
	}
	возврат (Buff_char & маска)! = 0 ;
}
// ------------------------------------------------ ---------
// записываем бит
void  Lz77File :: putbit ( логическое значение )
{
	if (val) buff_char | = маска;
	если ((маска >> = 1 ) == 0 )
	{
		_write (дескриптор, & buff_char, 1 );
		buff_char = 0 ;
		маска = 128 ; // двоичный 10000000
	}
}
// ------------------------------------------------ ---------
// записываем биты
void  Lz77File :: putbits ( int val, int n)
{
	int m = 1 ;
	для ( int i = 0 ; i <n; i ++)
	{
		положить бит ((val & m)! = 0 );
		m << = 1 ;
	}
}
// ------------------------------------------------ ---------
// читаем биты
INT  Lz77File :: getbits ( INT п)
{
	int результат = 0 ;
	для ( int i = 0 ; i <n; i ++)
		результат | = getbit () << i;
	вернуть результат;
}
